{
  "artisan":
  "SPs, being CONCRETE in communicating and UTILITARIAN in implementing goals, can become highly skilled in TACTICAL VARIATION.\n Thus their most practiced and developed intelligent operations are usually promoting and operating (SPT expediting), or displaying and composing (SPF improvising).\n  And they would if they could be virtuosos of one of these forms artistic operation.\n Artisans are proud of themselves in the degree they are graceful in action, respect themselves in the degree they are daring, and feel confident of themselves in the degree they are adaptable.\n This is the \"Sensation Seeking Personality\" -- trusting in spontaneity and hungering for impact on others.\n They are usually hedonic about the present, optimistic about the future, cynical about the past, and their preferred time and place is the here and now.\n Educationally they go for arts and crafts, avocationally for techniques, and vocationally for operations work.\n They tend to be permissive as parents, playmates as spouses, and play oriented as children.\n There are many Artisans to be found in many places where the action is, at least 35% and as many as 40% of the population.",

  "guardian":
  "SJs, being CONCRETE in communicating and COOPERATIVE in implementing goals, can become highly skilled in LOGISTICS.\n Thus their most practiced and developed intelligent operations are often supervising and inspecting (SJT administering), or supplying and protecting (SJF conserving).\n And they would if they could be magistrates watching over these forms of social facilitation.\n They are proud of themselves in the degree they are reliable in action, respect themselves in the degree they do good deeds, and feel confident of themselves in the degree they are respectable.\n In search of security as they are the \"Security Seeking Personality\" -- trusting in legitimacy and hungering for membership.\n They are usually stoical about the present, pessimistic about the future, fatalistic about the past, and their preferred time and place is the past and the gateway.\n Educationally they go for commerce, avocationally for regulations, and vocationally for material work.\n They tend to be enculturating as parents, helpmates as spouses, and conformity oriented as children.\n There are even more Guardians than Artisans around, at least 40% and as many as 45% of the population.",

  "idealist":
  "NFs, being ABSTRACT in communicating and COOPERATIVE in implementing goals, can become highly skilled in DIPLOMATIC INTEGRATION.\n Thus their most practiced and developed intelligent operations are usually teaching and counseling (NFJ mentoring), or conferring and tutoring (NFP advocating).\n And they would if they could be sages in one of these forms of social development.\n The Idealist temperament have an instinct for interpersonal integration, learn ethics with ever increasing zeal, sometimes become diplomatic leaders, and often speak interpretively and metaphorically of the abstract world of their imagination.\n They are proud of themselves in the degree they are empathic in action, respect themselves in the degree they are benevolent, and feel confident of themselves in the degree they are authentic.\n Idealist types search for their unique identity, hunger for deep and meaningful relationships, wish for a little romance each day, trust their intuitive feelings implicitly, aspire for profundity.\n This is the \"Identity Seeking Personality\" -- credulous about the future, mystical about the past, and their preferred time and place are the future and the pathway.\n Educationally they go for the humanities, avocationally for \"ethics\", and vocationally for personnel work.\n Social relationships: In their family interactions they strive for mutuality, provide spiritual intimacy for the mates, opportunity for fantasy for their children, and for themselves continuous self-renewal.\n Idealists do not abound, being as few as 8% and nor more than 10% of the population.",

  "rational":
  "NTs, being ABSTRACT in communicating and UTILITARIAN in implementing goals, can become highly skilled in STRATEGIC ANALYSIS.\n Thus their most practiced and developed intelligent operations tend to be marshalling and planning (NTJ organizing), or inventing and configuring (NTP engineering).\n And they would if they could be wizards in one of these forms of rational operation.\n They are proud of themselves in the degree they are competent in action, respect themselves in the degree they are autonomous, and feel confident of themselves in the degree they are strong willed.\n Ever in search of knowledge, this is the \"Knowledge Seeking Personality\" -- trusting in reason and hungering for achievement.\n They are usually pragmatic about the present, skeptical about the future, solipsistic about the past, and their preferred time and place are the interval and the intersection.\n Educationally they go for the sciences, avocationally for technology, and vocationally for systems work.\n Rationals tend to be individualizing as parents, mindmates as spouses, and learning oriented as children.\n Rationals are very infrequent, comprising as few as 5% and no more than 7% of the population."
}